Tekla Open API Reference for Tekla Structures 2025
Events.LayoutTableLayoutModified Event
 The event is raised when tablelayout is modified
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event LayoutTableLayoutModifiedDelegate LayoutTableLayoutModified
Public Event LayoutTableLayoutModified As LayoutTableLayoutModifiedDelegate
Value
Type: LayoutTableLayoutModifiedDelegate
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace